20240118070828-initializing_classes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Initializing Classes</title>
<meta name="author" content="Mikey" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Initializing Classes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge4707bd">1. Initializing Classes</a>
<ul>
<li><a href="#org89ed708">1.1. Example</a>
<ul>
<li><a href="#org782ecc8">1.1.1. Code Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge4707bd" class="outline-2">
<h2 id="orge4707bd"><span class="section-number-2">1.</span> Initializing Classes</h2>
<div class="outline-text-2" id="text-1">
<p>
First, we <b>initialize</b> the class, which involves <b>invoking</b> all <a href="Static Members.md.html#ID-fc670fe7-04be-4783-92b9-d97c7ee72bd7">static members</a> in the class hierarchy, starting with the highest <code>superclass</code> and working downward.
This is sometimes referred to as <b>loading the class</b>.
</p>

<p>
<code>JVM</code> controls when the <code>class</code> is <b>initialized</b>, although you can assume the class is loaded before it is used.
The class may be initialized when:
</p>
<ol class="org-ol">
<li>The program first starts.</li>
<li>A <code>static</code> member of the class is <b>referenced</b>.</li>
<li>Shortly before an <b>instance</b> of the <code>class</code> is <b>created</b>.</li>
</ol>

<p>
One of the most important rules with class <b>initialization</b> is that it happens at <b>most once</b> for each class.
The class may also <b>never</b> be loaded if it is <b>not used</b> in the program.
</p>
</div>
<div id="outline-container-org89ed708" class="outline-3">
<h3 id="org89ed708"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Initialize <code>Class X</code>
</p>
<ol class="org-ol">
<li>If there is a superclass <code>Y</code> of <code>X</code>, then initialize class <code>Y</code> first.</li>
<li>Process all <code>static</code> variable declarations in the order in which they appear in the class.</li>
<li>Process all <code>static</code> initializers in the order in which they appear in the class.</li>
</ol>
</div>
<div id="outline-container-org782ecc8" class="outline-4">
<h4 id="org782ecc8"><span class="section-number-4">1.1.1.</span> Code Example</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">static</span> { System.out.print(<span class="org-string">"A"</span>); }
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Hippo</span> <span class="org-keyword">extends</span> <span class="org-type">Animal</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">grass</span>) {
        System.out.print(<span class="org-string">"C"</span>);
        <span class="org-keyword">new</span> <span class="org-type">Hippo</span>();
        <span class="org-keyword">new</span> <span class="org-type">Hippo</span>();
        <span class="org-keyword">new</span> <span class="org-type">Hippo</span>();
    }
    <span class="org-keyword">static</span> { System.out.print(<span class="org-string">"B"</span>); }
}
</pre>
</div>

<p>
It prints <code>ABC</code> exactly <b>once</b>.
</p>

<p>
Since the <code>main()</code> method is inside the <code>Hippo</code> class, the class will be initialized first, starting with the <code>superclass</code> and printing <code>AB</code>. Afterward, the <code>main()</code> method is executed, printing <code>C</code>.
Even though the <code>main()</code> method creates three instances, the class is loaded <b>only once</b>.
</p>
</div>
<ol class="org-ol">
<li><a id="org9559b34"></a><span class="underline">Exam Trick</span><br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
For the exam, you just need to know that a class <b>must be initialized</b> before it is <code>referenced</code> or <code>used</code>.
Also, the class containing the program entry point, aka the <code>main()</code> method, is loaded before the <code>main()</code> method is executed.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
